OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_hal_canfd.h
/**
  ******************************************************************************
  * @file    py32f4xx_hal_canfd.h
  * @author  MCU Application Team
  * @brief   Header file of CNAFD HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __PY32F4xx_HAL_CANFD_H
#define __PY32F4xx_HAL_CANFD_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f4xx_hal_def.h"

/** @addtogroup PY32F4xx_HAL_Driver
  * @{
  */

/** @addtogroup CANFD
  * @{
  */
#if defined ( __CC_ARM   )
#pragma anon_unions
#endif

/* Exported types ------------------------------------------------------------*/
/** @defgroup CANFD_Exported_Types CANFD Exported Types
  * @{
  */

/**
  * @brief HAL State structures definition
  */
typedef enum
{
  HAL_CANFD_STATE_RESET             = 0x00U,  /*!< CANFD not yet initialized or disabled */
  HAL_CANFD_STATE_READY             = 0x01U,  /*!< CANFD initialized and ready for use   */
  HAL_CANFD_STATE_BUSY              = 0x02U,  /*!< CANFD process is ongoing              */
  HAL_CANFD_STATE_LISTENING         = 0x03U,  /*!< CANFD receive process is ongoing      */
  HAL_CANFD_STATE_SLEEP_PENDING     = 0x04U,  /*!< CANFD sleep request is pending        */
  HAL_CANFD_STATE_SLEEP_ACTIVE      = 0x05U,  /*!< CANFD sleep mode is active            */
  HAL_CANFD_STATE_ERROR             = 0x06U   /*!< CANFD error state                     */
} HAL_CANFD_StateTypeDef;

/**
  * @brief CANFD LLC frame format Structure definition
  */
typedef struct
{
  uint32_t DLC:       11;
  uint32_t Reserved1: 5;
  uint32_t IDE:       1;
  uint32_t FDF:       1;
  uint32_t BRS:       1;
  uint32_t Reserved2: 1;
  uint32_t RMF:       1;
  uint32_t Reserved3: 3;
  uint32_t KOER:      3;
  uint32_t ESI:       1;
  uint32_t LBF:       1;
  uint32_t Reserved4: 3;
} CANFD_FormatfieldTypeDef;

/**
  * @brief CANFD Init Structure definition
  */
typedef struct
{
  uint32_t          FrameFormat;                  /*!< Specifies the CANFD frame format.
                                                       This parameter can be a value of @ref CANFD_frame_format     */
    
  uint32_t          Mode;                         /*!< Specifies the CAN operating mode.
                                                         This parameter can be a value of @ref CANFD_operating_mode */

  uint32_t          CANFDProtocol;                /*!< CAN-FD protocol, Bosch CAN-FD or 11898-1:2015 CAN-FD.
                                                         This parameter can be a value of @ref CANFD_FD_protocol */

  uint32_t          Prescaler;                    /*!< Specifies the value by which the oscillator frequency is
                                                         divided for generating the bit time quanta.
                                                         This parameter must be a number between Min_Data = 1 and Max_Data = 32. */

  uint32_t          NominalSyncJumpWidth;         /*!< Specifies the maximum number of time quanta the CANFD
                                                         hardware is allowed to lengthen or shorten a bit to perform
                                                         resynchronization.This parameter must be a number between 1 and 128 */

  uint32_t          NominalTimeSeg1;              /*!< Specifies the number of time quanta in Bit Segment 1.
                                                         This parameter must be a number between 2 and 513 */

  uint32_t          NominalTimeSeg2;              /*!< Specifies the number of time quanta in Bit Segment 2.
                                                         This parameter must be a number between 1 and 128 */

  uint32_t          DataSyncJumpWidth;            /*!< Specifies the maximum number of time quanta the CANFD
                                                         hardware is allowed to lengthen or shorten a data bit to
                                                         perform resynchronization.This parameter must be a number between 1 and 128 */

  uint32_t          DataTimeSeg1;                 /*!< Specifies the number of time quanta in Data Bit Segment 1.
                                                         This parameter must be a number between 2 and 257 */

  uint32_t          DataTimeSeg2;                 /*!< Specifies the number of time quanta in Data Bit Segment 2.
                                                         This parameter must be a number between 1 and 128 */

  uint32_t          SecondSamplePointOffset;      /*!< Specify secondary sample point(SSP) of transmitter delay compensatin(TDC). Number of TQ.
                                                         This parameter must be a number between 0 and 255 */
} CANFD_InitTypeDef;


/**
  * @brief  CANFD Tx header structure definition
  */
typedef struct
{
  uint32_t Identifier;          /*!< Specifies the identifier.
                                     This parameter must be a number between:
                                      - 0 and 0x7FF, if IdType is CANFD_STANDARD_ID
                                      - 0 and 0x1FFFFFFF, if IdType is CANFD_EXTENDED_ID               */

  uint32_t IdType;              /*!< Specifies the identifier type for the message that will be
                                     transmitted.
                                     This parameter can be a value of @ref CANFD_id_type               */

