OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_hal_canfd.h
  uint32_t TxEnableWindow;           /*!< Specifies the Transmit Enable Window.
                                           This parameter must be a number between 1 and 15           */

  uint32_t WatchTrigTime;            /*!< Specifies the Application Watchdog Limit.
                                           This parameter must be a number between 0 and 0xFFFF              */

} CANFD_TimeTriggerTypeDef;

/**
  * @brief CANFD Protocol Status structure definition
  */
typedef struct
{
  uint32_t TxErrorCnt;        /*!< Specifies the Transmit Error Counter Value.
                                   This parameter can be a number between 0 and 255                                          */

  uint32_t RxErrorCnt;        /*!< Specifies the Receive Error Counter Value.
                                   This parameter can be a number between 0 and 255                                          */
  
  uint32_t LastErrorCode;     /*!< Specifies the type of the last error that occurred on the CANFD bus.
                                   This parameter can be a value of @ref CANFD_protocol_error_type                           */
  
  uint32_t LastArbLostPos;    /*!< Specifies the position of the last arbitration lost on the CANFD bus. 
                                   This parameter can be a number between 0 and 31                                           */

  uint32_t ErrorPassive;      /*!< Specifies the CANFD module error status.
                                   This parameter can be:
                                    - 0 : The CANFD is in Error_Active state
                                    - 1 : The CANFD is in Error_Passive state                                                */

  uint32_t Warning;           /*!< Specifies the CANFD module warning status.
                                   This parameter can be:
                                    - 0 : error counters (RxErrorCnt and TxErrorCnt) are below the Error_Warning limit
                                    - 1 : at least one of error counters has reached the Error_Warning limit          */

  uint32_t BusOff;            /*!< Specifies the CANFD module Bus_Off status.
                                   This parameter can be:
                                    - 0 : The CANFD is not in Bus_Off state
                                    - 1 : The CANFD is in Bus_Off state                                                      */

} CANFD_ProtocolStatusTypeDef;

/**
  * @brief CANFD transmit status Structure definition
  */
typedef struct
{
  uint32_t LastTxHandle;     /*!< Specifies the handle value of the last Tx frame.
                                  This parameter can be a number between 0 and 255                                           */
  
  uint32_t LastTxStatus;     /*!< Specifies the status of the last Tx frame.
                                  This parameter can be a value of @ref CANFD_transmit_status                                */
  
  uint32_t TxHandle;         /*!< Specifies the handle value of the current Tx frame.
                                  This parameter can be a number between 0 and 255                                           */

  uint32_t TxStatus;         /*!< Specifies the status of the current Tx frame.
                                  This parameter can be a value of @ref CANFD_transmit_status                                */
  
} CANFD_TxStatusTypeDef;


#if USE_HAL_CANFD_REGISTER_CALLBACKS == 1
typedef struct __CANFD_HandleTypeDef
#else
typedef struct
#endif /* USE_HAL_CANFD_REGISTER_CALLBACKS */
{
  CANFD_TypeDef                 *Instance;                 /*!< Register base address */

  CANFD_InitTypeDef             Init;                      /*!< CANFD required parameters */

  __IO HAL_CANFD_StateTypeDef   State;                     /*!< CANFD communication state */

  HAL_LockTypeDef               Lock;                      /*!< CANFD locking object      */

  __IO uint32_t                 ErrorCode;                 /*!< CANFD Error code. */

  uint32_t                      LastTimeTrigType;          /*!< CANFD last time trig type */

  uint32_t                      LastAbortTxType;           /*!< CANFD last abort transmit type */

  uint32_t                      LastSTBTxType;             /*!< CANFD last STB transmit type */

#if USE_HAL_CANFD_REGISTER_CALLBACKS == 1
  void (* RxCpltCallback)(__CANFD_HandleTypeDef *hcan);
  void (* RxFifoAlmostFullCallback)(__CANFD_HandleTypeDef *hcan);
  void (* RxFifoFullCallback)(__CANFD_HandleTypeDef *hcan);
  void (* PtbTxCpltCallback)(__CANFD_HandleTypeDef *hcan);
  void (* StbTxCpltCallback)(__CANFD_HandleTypeDef *hcan, uint32_t LastSTBTxType);
  void (* RxFifoOverflowCallback)(__CANFD_HandleTypeDef *hcan);
  void (* ArbitrationLostCallback)(__CANFD_HandleTypeDef *hcan);
  void (* TxAbortCallback)(__CANFD_HandleTypeDef *hcan, uint32_t LastAbortTxType);
  void (* PassiveErrorCallback)(__CANFD_HandleTypeDef *hcan);
  void (* BusErrorCallback)(__CANFD_HandleTypeDef *hcan);
  void (* ErrorChangeCallback)(__CANFD_HandleTypeDef *hcan);
  void (* TT_RxTimeTrigCallback)(__CANFD_HandleTypeDef *hcan);
  void (* TT_TxSingleTrigCallback)(__CANFD_HandleTypeDef *hcan);
  void (* TT_TxStartTrigCallback)(__CANFD_HandleTypeDef *hcan);
  void (* TT_TxStopTrigCallback)(__CANFD_HandleTypeDef *hcan);
  void (* TT_TimestampWraparoundCallback)(__CANFD_HandleTypeDef *hcan);
  void (* TT_TrigErrorCallback)(__CANFD_HandleTypeDef *hcan);  
  
  void (* MspInitCallback)(struct __CANFD_HandleTypeDef *hfdcan);                     /*!< CANFD Msp Init callback              */
  void (* MspDeInitCallback)(struct __CANFD_HandleTypeDef *hfdcan);                   /*!< CANFD Msp DeInit callback            */
#endif /* USE_HAL_CANFD_REGISTER_CALLBACKS */

} CANFD_HandleTypeDef;

#if USE_HAL_CANFD_REGISTER_CALLBACKS == 1
/**
  * @brief  HAL CANFD common Callback ID enumeration definition
  */
typedef enum
{
  HAL_CANFD_RX_COMPLETE_CB_ID             = 0x00U,    /*!< CANFD Rx complete callback ID                */
  HAL_CANFD_RX_FIFO_ALMOST_FULL_CB_ID     = 0x01U,    /*!< CANFD Rx fifo almost full callback ID        */
  HAL_CANFD_RX_FIFO_FULL_CB_ID            = 0x02U,    /*!< CANFD Rx fifo full callback ID               */
  HAL_CANFD_PTB_TX_COMPLETE_CB_ID         = 0x03U,    /*!< CANFD PTB Tx complete callback ID            */
  HAL_CANFD_STB_TX_COMPLETE_CB_ID         = 0x04U,    /*!< CANFD STB Tx complete callback ID            */
  HAL_CANFD_TX_ABORT_CB_ID                = 0x05U,    /*!< CANFD Tx abort callback ID                   */
  HAL_CANFD_RX_FIFO_OVERFLOW_CB_ID        = 0x06U,    /*!< CANFD Rx fifo overflow callback ID           */
  HAL_CANFD_ARBITRATION_LOST_CB_ID        = 0x07U,    /*!< CANFD Arbitration lost callback ID           */

  HAL_CANFD_PASSIVE_ERROR_CB_ID           = 0x08U,    /*!< CANFD Passive error callback ID              */
  HAL_CANFD_BUS_ERROR_CB_ID               = 0x09U,    /*!< CANFD Bus error callback ID                  */
  HAL_CANFD_ERROR_CHANGE_CB_ID            = 0x0AU,    /*!< CANFD Error change callback ID               */

  HAL_CANFD_TT_RX_TIME_TRIG_CB_ID         = 0x0BU,    /*!< CANFD TT Rx time trig callback ID            */
  HAL_CANFD_TT_TX_SINGLE_TRIG_CB_ID       = 0x0CU,    /*!< CANFD TT Tx single trig callback ID          */
  HAL_CANFD_TT_TX_START_TRIG_CB_ID        = 0x0DU,    /*!< CANFD TT Tx start trig callback ID           */
  HAL_CANFD_TT_TX_STOP_TRIG_CB_ID         = 0x0EU,    /*!< CANFD TT Tx stop trig callback ID            */
  HAL_CANFD_TT_TIMESTAMP_WRAPAROUND_CB_ID = 0x0FU,    /*!< CANFD TT timestamp wraparound callback ID    */

  HAL_CANFD_TT_TRIG_ERROR_CB_ID           = 0x10U,    /*!< CANFD TT trig error callback ID              */

  HAL_CANFD_MSPINIT_CB_ID                 = 0x11U,    /*!< CANFD MspInit callback ID                    */
  HAL_CANFD_MSPDEINIT_CB_ID               = 0x12U,    /*!< CANFD MspDeInit callback ID                  */

} HAL_CANFD_CallbackIDTypeDef;

/**
  * @brief  HAL CANFD Callback pointer definition
  */
typedef  void (*pCANFD_CallbackTypeDef)(CANFD_HandleTypeDef *hcanfd);     /*!< pointer to a common CANfd callback function */

#endif /* USE_HAL_CANFD_REGISTER_CALLBACKS */

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup CANFD_Exported_Constants CANFD Exported Constants
  * @{
  */

/** @defgroup HAL_CANFD_Error_Code HAL CANFD Error Code
  * @{
  */
#define HAL_CANFD_ERROR_NONE            ((uint32_t)0x00000000U) /*!< No error                                                               */
#define HAL_CANFD_ERROR_TIMEOUT         ((uint32_t)0x00000001U) /*!< Timeout error                                                          */
#define HAL_CANFD_ERROR_NOT_INITIALIZED ((uint32_t)0x00000002U) /*!< Peripheral not initialized                                             */
#define HAL_CANFD_ERROR_NOT_READY       ((uint32_t)0x00000004U) /*!< Peripheral not ready                                                   */
#define HAL_CANFD_ERROR_NOT_STARTED     ((uint32_t)0x00000008U) /*!< Peripheral not started                                                 */
#define HAL_CANFD_ERROR_NOT_SUPPORTED   ((uint32_t)0x00000010U) /*!< Mode not supported                                                     */
#define HAL_CANFD_ERROR_PARAM           ((uint32_t)0x00000020U) /*!< Parameter error                                                        */
#define HAL_CANFD_ERROR_PENDING         ((uint32_t)0x00000040U) /*!< Pending operation                                                      */
#define HAL_CANFD_ERROR_RAM_ACCESS      ((uint32_t)0x00000080U) /*!< Message RAM Access Failure                                             */
#define HAL_CANFD_ERROR_FIFO_EMPTY      ((uint32_t)0x00000100U) /*!< Get element from empty FIFO                                            */
#define HAL_CANFD_ERROR_FIFO_FULL       ((uint32_t)0x00000200U) /*!< Put element in full FIFO                                               */

#if USE_HAL_CANFD_REGISTER_CALLBACKS == 1
#define HAL_CANFD_ERROR_INVALID_CALLBACK ((uint32_t)0x00000400U) /*!< Invalid Callback error                                                */
#endif /* USE_HAL_CANFD_REGISTER_CALLBACKS */
/**
  * @}
  */
  
/** @defgroup CANFD_frame_format CANFD Frame Format
  * @{
  */
#define CANFD_FRAME_CLASSIC   ((uint32_t)0x00000000U)                     /*!< Classic mode                      */
#define CANFD_FRAME_FD_NO_BRS ((uint32_t)0x00020000U)                     /*!< FD mode without BitRate Switching */
#define CANFD_FRAME_FD_BRS    ((uint32_t)(0x00020000U | 0x00040000U))     /*!< FD mode with BitRate Switching    */
/**
  * @}
  */

/** @defgroup CANFD_data_length_code CANFD Data Length Code
  * @{
  */
#define CANFD_DLC_BYTES_0              ((uint32_t)0x00000000U) /*!< 0 bytes data field  */
#define CANFD_DLC_BYTES_1              ((uint32_t)0x00000001U) /*!< 1 bytes data field  */
#define CANFD_DLC_BYTES_2              ((uint32_t)0x00000002U) /*!< 2 bytes data field  */
#define CANFD_DLC_BYTES_3              ((uint32_t)0x00000003U) /*!< 3 bytes data field  */
#define CANFD_DLC_BYTES_4              ((uint32_t)0x00000004U) /*!< 4 bytes data field  */
#define CANFD_DLC_BYTES_5              ((uint32_t)0x00000005U) /*!< 5 bytes data field  */
#define CANFD_DLC_BYTES_6              ((uint32_t)0x00000006U) /*!< 6 bytes data field  */
#define CANFD_DLC_BYTES_7              ((uint32_t)0x00000007U) /*!< 7 bytes data field  */
#define CANFD_DLC_BYTES_8              ((uint32_t)0x00000008U) /*!< 8 bytes data field  */
#define CANFD_DLC_BYTES_12             ((uint32_t)0x00000009U) /*!< 12 bytes data field */
#define CANFD_DLC_BYTES_16             ((uint32_t)0x0000000AU) /*!< 16 bytes data field */
#define CANFD_DLC_BYTES_20             ((uint32_t)0x0000000BU) /*!< 20 bytes data field */
#define CANFD_DLC_BYTES_24             ((uint32_t)0x0000000CU) /*!< 24 bytes data field */
#define CANFD_DLC_BYTES_32             ((uint32_t)0x0000000DU) /*!< 32 bytes data field */
#define CANFD_DLC_BYTES_48             ((uint32_t)0x0000000EU) /*!< 48 bytes data field */
#define CANFD_DLC_BYTES_64             ((uint32_t)0x0000000FU) /*!< 64 bytes data field */
/**
  * @}
  */

/** @defgroup CANFD_LLC_FORMAT_BITS CANFD LLC format bits
  * @{
  */
#define CANFD_LLC_FORMAT_DLC_0         ((uint32_t)0x00000001U)         /*!< BIT DLC_0  */
#define CANFD_LLC_FORMAT_DLC_1         ((uint32_t)0x00000002U)         /*!< BIT DLC_1  */
#define CANFD_LLC_FORMAT_DLC_2         ((uint32_t)0x00000004U)         /*!< BIT DLC_2  */
#define CANFD_LLC_FORMAT_DLC_3         ((uint32_t)0x00000008U)         /*!< BIT DLC_3  */
#define CANFD_LLC_FORMAT_IDE           ((uint32_t)0x00010000U)         /*!< BIT IDE    */
#define CANFD_LLC_FORMAT_FDF           ((uint32_t)0x00020000U)         /*!< BIT FDF    */
#define CANFD_LLC_FORMAT_BRS           ((uint32_t)0x00040000U)         /*!< BIT BRS    */
#define CANFD_LLC_FORMAT_RMF           ((uint32_t)0x00100000U)         /*!< BIT RMF    */
#define CANFD_LLC_FORMAT_KOER_0        ((uint32_t)0x01000000U)         /*!< BIT KOER_0 */
#define CANFD_LLC_FORMAT_KOER_1        ((uint32_t)0x02000000U)         /*!< BIT KOER_1 */
#define CANFD_LLC_FORMAT_KOER_2        ((uint32_t)0x04000000U)         /*!< BIT KOER_2 */
#define CANFD_LLC_FORMAT_ESI           ((uint32_t)0x08000000U)         /*!< BIT ESI    */
#define CANFD_LLC_FORMAT_LBF           ((uint32_t)0x10000000U)         /*!< BIT LBF    */

#define CANFD_LLC_FORMAT_DLC           ((uint32_t)0x0000000FU)         /*!< BIT DLC    */
#define CANFD_LLC_FORMAT_KOER          ((uint32_t)0x07000000U)         /*!< BIT KOER   */

#define CANFD_LLC_FORMAT_KOER_Pos      (24)                            /*!< BIT KOER Pos   */
/**
  * @}
  */

/** @defgroup CANFD_id_type CANFD id type
  * @{
  */
#define CANFD_STANDARD_ID            ((uint32_t)0x00000000U)         /*!< Standard ID element */
#define CANFD_EXTENDED_ID            ((uint32_t)0x00010000U)         /*!< Extended ID element */
/**
  * @}
  */

/** @defgroup CANFD_format CANFD Frame Format
  * @{
  */
#define CANFD_CLASSIC_CAN            ((uint32_t)0x00000000U)         /*!< Classic frame      */
#define CANFD_FD_CAN                 ((uint32_t)0x00020000U)         /*!< FD frame           */
/**
  * @}
  */

/** @defgroup CANFD_bit_rate_switching CANFD Bit Rate Switching
  * @{
  */
#define CANFD_BRS_OFF        ((uint32_t)0x00000000U)          /*!< FD mode without BitRate Switching */
#define CANFD_BRS_ON         ((uint32_t)0x00040000U)          /*!< FD mode with BitRate Switching    */
/**
  * @}
  */

/** @defgroup CANFD_frame_type CANFD frame type
  * @{
  */
#define CANFD_DATA_FRAME                   ((uint32_t)0x00000000U)         /*!< data frame        */
#define CANFD_REMOTE_FRAME                 ((uint32_t)0x00100000U)         /*!< remote frame      */
/**
  * @}
  */

/** @defgroup CANFD_protocol_error_type CANFD frame error type
  * @{
  */
#define CANFD_PROTOCOL_NONE_ERROR             ((uint32_t)0x00000000U)         /*!< no error                     */
#define CANFD_PROTOCOL_BIT_ERROR              ((uint32_t)0x00000001U)         /*!< frame bit error              */
#define CANFD_PROTOCOL_FORM_ERROR             ((uint32_t)0x00000002U)         /*!< frame form error             */
#define CANFD_PROTOCOL_STUFF_ERROR            ((uint32_t)0x00000003U)         /*!< frame bit sruff error        */
#define CANFD_PROTOCOL_ACK_ERROR              ((uint32_t)0x00000004U)         /*!< frame ack error              */
#define CANFD_PROTOCOL_CRC_ERROR              ((uint32_t)0x00000005U)         /*!< all stored data are invalid  */
#define CANFD_PROTOCOL_OTHER_ERROR            ((uint32_t)0x00000006U)         /*!< OTHER ERROR  */
/**
  * @}
  */

/** @defgroup CANFD_error_state_indicator CANFD Error State Indicator
  * @{
  */
#define CANFD_ESI_ACTIVE            ((uint32_t)0x00000000U)         /*!< CANFD node is error active     */
#define CANFD_ESI_PASSIVE           ((uint32_t)0x08000000U)         /*!< CANFD node is error passive    */
/**
  * @}
  */

/** @defgroup CANFD_loopback_frame CANFD loop back frame
  * @{
  */
#define CANFD_LOOPBACK_FRAME_ON         ((uint32_t)0x00000000U)         /*!< CANFD receive frame is LoopBack frame     */
#define CANFD_LOOPBACK_FRAME_OFF        ((uint32_t)0x10000000U)         /*!< CANFD receive frame is not LoopBack frame */
/**
  * @}
  */

/** @defgroup CANFD_operating_mode CANFD Operating Mode
* @{
*/
#define CANFD_MODE_NORMAL                (0x00000000U)                                  /*!< Normal mode   */
#define CANFD_MODE_RESTRICTED_OPERATION  ((uint32_t)CANFD_TSNCR_ROP)                    /*!< Restricted operation mode */
#define CANFD_MODE_LOOPBACK_EXT_NOACK    ((uint32_t)CANFD_MCR_LBME)                     /*!< Loopback mode */
#define CANFD_MODE_LOOPBACK_EXT_ACK      ((uint32_t)(CANFD_MCR_LBME | CANFD_MCR_SACK))  /*!< Loopback mode */
#define CANFD_MODE_LOOPBACK_INT          ((uint32_t)CANFD_MCR_LBMI)                     /*!< Loopback mode */
#define CANFD_MODE_SILENT                ((uint32_t)CANFD_MCR_LOM)                      /*!< Silent mode   */
#define CANFD_MODE_SILENT_LOOPBACK       ((uint32_t)(CANFD_MCR_LOM | CANFD_MCR_LBME))   /*!< Loopback combined with silent mode */
/**
  * @}
  */

