OpenPuya/PY32F040_Firmware/Drivers/PY32F4xx_HAL_Driver/Inc/py32f4xx_hal_canfd.h
/** @defgroup CANFD_retransmission_Limit CANFD Retransmission Limit
* @{
*/
#define CANFD_AUTO_RETRANSMISSION_1TRANSFER           (0x00000000U)
#define CANFD_AUTO_RETRANSMISSION_2TRANSFERS          ((uint32_t)CANFD_RLSSP_RETLIM_0)
#define CANFD_AUTO_RETRANSMISSION_3TRANSFERS          ((uint32_t)CANFD_RLSSP_RETLIM_1)
#define CANFD_AUTO_RETRANSMISSION_4TRANSFERS          ((uint32_t)(CANFD_RLSSP_RETLIM_0|CANFD_RLSSP_RETLIM_1))
#define CANFD_AUTO_RETRANSMISSION_5TRANSFERS          ((uint32_t)CANFD_RLSSP_RETLIM_2)
#define CANFD_AUTO_RETRANSMISSION_6TRANSFERS          ((uint32_t)(CANFD_RLSSP_RETLIM_0 | CANFD_RLSSP_RETLIM_2))
#define CANFD_AUTO_RETRANSMISSION_7TRANSFERS          ((uint32_t)(CANFD_RLSSP_RETLIM_1 | CANFD_RLSSP_RETLIM_2))
#define CANFD_AUTO_RETRANSMISSION_NO_LIMIT            ((uint32_t)(CANFD_RLSSP_RETLIM_0 | CANFD_RLSSP_RETLIM_1 | CANFD_RLSSP_RETLIM_2))
/**
  * @}
  */

/** @defgroup CANFD_rearbitration_Limit CANFD Rearbitration Limit
* @{
*/
#define CANFD_AUTO_REARBITRATION_1TRANSFER           (0x00000000U)
#define CANFD_AUTO_REARBITRATION_2TRANSFERS          ((uint32_t)CANFD_RLSSP_REALIM_0)
#define CANFD_AUTO_REARBITRATION_3TRANSFERS          ((uint32_t)CANFD_RLSSP_REALIM_1)
#define CANFD_AUTO_REARBITRATION_4TRANSFERS          ((uint32_t)(CANFD_RLSSP_REALIM_0|CANFD_RLSSP_REALIM_1))
#define CANFD_AUTO_REARBITRATION_5TRANSFERS          ((uint32_t)CANFD_RLSSP_REALIM_2)
#define CANFD_AUTO_REARBITRATION_6TRANSFERS          ((uint32_t)(CANFD_RLSSP_REALIM_0 | CANFD_RLSSP_REALIM_2))
#define CANFD_AUTO_REARBITRATION_7TRANSFERS          ((uint32_t)(CANFD_RLSSP_REALIM_1 | CANFD_RLSSP_REALIM_2))
#define CANFD_AUTO_REARBITRATION_NO_LIMIT            ((uint32_t)(CANFD_RLSSP_REALIM_0 | CANFD_RLSSP_REALIM_1 | CANFD_RLSSP_REALIM_2))
/**
  * @}
  */
  
/** @defgroup CANFD_RX_FIFO_threshold CANFD receive fifo almost full warning limit.
* @{
*/
#define CANFD_RX_FIFO_THRESHOLD_1SLOT          ((uint32_t)CANFD_WECR_AFWL_0)
#define CANFD_RX_FIFO_THRESHOLD_2SLOTS         ((uint32_t)CANFD_WECR_AFWL_1)
#define CANFD_RX_FIFO_THRESHOLD_3SLOTS         ((uint32_t)(CANFD_WECR_AFWL_0 | CANFD_WECR_AFWL_1))
/**
  * @}
  */
  
/**
 * @defgroup CANFD_FD_protocol CANFD FD Protocol
 * @{
 */
#define CANFD_FD_BOSCH               (0x00000000U)
#define CANFD_FD_ISO_11898           (CANFD_MCR_FD_ISO)
/**
 * @}
 */

/**
 * @defgroup CANFD_transmit_mode CANFD transmit Mode
 * @{
 */
#define CANFD_TXFIFO_PTB_SEND            (0x00000001U)
#define CANFD_TXFIFO_STB_SEND_ONE        (0x00000002U)
#define CANFD_TXFIFO_STB_SEND_ALL        (0x00000004U)
/**
 * @}
 */

/**
* @defgroup CANFD_filter_channel CANFD Acceptance Channel
* @{
*/
#define CANFD_FILTER_CHANNEL_0           (0x00000000U)
#define CANFD_FILTER_CHANNEL_1           (0x00000001U)
#define CANFD_FILTER_CHANNEL_2           (0x00000002U)
#define CANFD_FILTER_CHANNEL_3           (0x00000003U)
#define CANFD_FILTER_CHANNEL_4           (0x00000004U)
#define CANFD_FILTER_CHANNEL_5           (0x00000005U)
#define CANFD_FILTER_CHANNEL_6           (0x00000006U)
#define CANFD_FILTER_CHANNEL_7           (0x00000007U)
#define CANFD_FILTER_CHANNEL_8           (0x00000008U)
#define CANFD_FILTER_CHANNEL_9           (0x00000009U)
#define CANFD_FILTER_CHANNEL_10          (0x0000000AU)
#define CANFD_FILTER_CHANNEL_11          (0x0000000BU)
/**
 * @}
 */

/** @defgroup CANFD_filter_rank CANFD Filter rank
  * @{
  */
#define CANFD_FILTER_RANK_CHANNEL_NUMBER (0x00000000U)  /*!< Enable the rank of the selected channels.  */
#define CANFD_FILTER_RANK_NONE           (0x00000001U)  /*!< Disable the selected rank (selected channel).  */
/**
  * @}
  */

/**
 * @defgroup CANFD_RX_FIFO_overflow_mode CANFD Receive Buffer Overflow Mode
 * @{
 */
#define CANFD_RX_FIFO_OVERWRITE          (0x00000000U)    /*!< Rx FIFO overwrite mode */
#define CANFD_RX_FIFO_BLOCKING           (CANFD_MCR_ROM)   /*!< Rx FIFO blocking mode  */
/**
 * @}
 */

/**
 * @defgroup CANFD_receive_fifo_state CANFD Receive Buffer status
 * @{
 */
#define CANFD_RX_FIFO_EMPTY                    (0x00000000U)                           /*!< Rx FIFO empty  */
#define CANFD_RX_FIFO_LE_AFWL                  (CANFD_MCR_RSTAT_0)                     /*!< Rx FIFO more than empty and less than almost full (AFWL) */
#define CANFD_RX_FIFO_GT_AFWL                  (CANFD_MCR_RSTAT_1)                     /*!< Rx FIFO Greater than or equal to almost full */
#define CANFD_RX_FIFO_FULL                     (CANFD_MCR_RSTAT_0 | CANFD_MCR_RSTAT_1) /*!< Rx FIFO full */
/**
 * @}
 */

/**
 * @defgroup CANFD_transmit_fifo_state CANFD Transmit Buffer status
 * @{
 */
#define CANFD_STB_FIFO_EMPTY                  (0x00000000U)   /*!< STB FIFO empty  */
#define CANFD_STB_FIFO_LE_HF                  (CANFD_MCR_TSSTAT_0)   /*!< STB FIFO less than or equal to half full */
#define CANFD_STB_FIFO_GT_HF                  (CANFD_MCR_TSSTAT_1)   /*!< STB FIFO More than half full */
#define CANFD_STB_FIFO_FULL                   (CANFD_MCR_TSSTAT_0 | CANFD_MCR_TSSTAT_1)   /*!< STB FIFO full */
/**
 * @}
 */

/**
 * @defgroup CANFD_fifo_type CANFD Transmit FIFO type
 * @{
 */
#define CANFD_TX_FIFO_PTB                     (0x0U)
#define CANFD_TX_FIFO_STB                     (0x1U)
/**
 * @}
 */

/**
 * @defgroup CANFD_STB_priority_mode CANFD STB Priority Mode
 * @{
 */
#define CANFD_STB_PRIORITY_FIFO               (0x0U)                  /*!< Data first in and first be transmitted. */
#define CANFD_STB_PRIORITY_ID                 (CANFD_MCR_TSMODE)      /*!< Data with smallest ID first be transmitted. */
/**
 * @}
 */

/**
 * @defgroup CANFD_transmit_status CANFD Tx Frame status
 * @{
 */
#define CANFD_TRANSMIT_STATUS_IDLE               (0x00000000U)                  /*!< No transmission in progress. */
#define CANFD_TRANSMIT_STATUS_ONGOING            (0x00000001U)                  /*!< Transmission active without any issues. */
#define CANFD_TRANSMIT_STATUS_LOST_ARBITRATION   (0x00000002U)                  /*!< Arbitration lost. re-arbitration may take place with respect to REALIM. */
#define CANFD_TRANSMIT_STATUS_TRANSMITTED        (0x00000003U)                  /*!< Transmission successfully completed. */
#define CANFD_TRANSMIT_STATUS_ABORTED            (0x00000004U)                  /*!< Transmission aborted (TPA, TSA). */
#define CANFD_TRANSMIT_STATUS_DISTURBED          (0x00000005U)                  /*!< Transmission error. Retransmission may take place with respect to RETLIM. */
#define CANFD_TRANSMIT_STATUS_REJECTED           (0x00000006U)                  /*!< Misconfiguration of the frame format in the LLC frame. */
/**
 * @}
 */
 
/**
 * @defgroup CANFD_TT_trigger_type TTCAN Trigger Type
 * @{
 */
#define CANFD_TT_IMMEDIATE_TRIGGER        (0x0U)
#define CANFD_TT_RX_TIME_TRIG             (CANFD_TTCR_TTYPE_0)
#define CANFD_TT_TX_SINGLE_TRIG           (CANFD_TTCR_TTYPE_1)
#define CANFD_TT_TX_START_TRIG            (CANFD_TTCR_TTYPE_0 | CANFD_TTCR_TTYPE_1)
#define CANFD_TT_TX_STOP_TRIG             (CANFD_TTCR_TTYPE_2)
/**
 * @}
 */

/**
 * @defgroup CANFD_TTCAN_FIFO_mode TTCAN FIFO mode
 * @{
 */
#define CANFD_TT_FIFO_PTB_STB           (0x0U)
#define CANFD_TT_FIFO_MERGE             (CANFD_MCR_TTTBM)
/**
 * @}
 */

/**
 * @defgroup CANFD_TT_FIFO_INDEX TTCAN FIFO index
 * @{
 */
#define CANFD_TT_FIFO_SLOT0             (0x00000000U)
#define CANFD_TT_FIFO_SLOT1             (0x00000001U)
#define CANFD_TT_FIFO_SLOT2             (0x00000002U)
#define CANFD_TT_FIFO_SLOT3             (0x00000003U)
/**
 * @}
 */

/**
 * @defgroup CANFD_TT_FIFO_State_Set TTCAN FIFO State Set
 * @{
 */
#define CANFD_TT_FIFO_SLOT_SET_EMPTY    (CANFD_TTCR_TBE)
#define CANFD_TT_FIFO_SLOT_SET_FULL     (CANFD_TTCR_TBF)
/**
 * @}
 */
 
/** @defgroup CANFD_timestamp_prescaler CANFD timestamp prescaler
  * @{
  */
#define CANFD_TT_PRESC_1                ((uint32_t)0x00000000U)                       /*!< Timestamp counter time unit in equal to CAN bit time                 */
#define CANFD_TT_PRESC_2                (CANFD_TTCR_T_PRESC_0)                        /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 2  */
#define CANFD_TT_PRESC_4                (CANFD_TTCR_T_PRESC_1)                        /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 4  */
#define CANFD_TT_PRESC_8                (CANFD_TTCR_T_PRESC_0 |CANFD_TTCR_T_PRESC_1)  /*!< Timestamp counter time unit in equal to CAN bit time multiplied by 8  */
/**
  * @}
  */

/** @defgroup CANFD_flags CANFD Flags
  * @{
  */
#define CANFD_FLAG_TX_STB_COMPLETE             CANFD_IFR_TSIF             /*!< STB Transmission Completed   */
#define CANFD_FLAG_TX_PTB_COMPLETE             CANFD_IFR_TPIF             /*!< PTB Transmission Completed   */
#define CANFD_FLAG_TX_ABORT_COMPLETE           CANFD_IFR_AIF              /*!< Transmission Cancellation Finished */
#define CANFD_FLAG_RX_COMPLETE                 CANFD_IFR_RIF              /*!< Rx Completed   */
#define CANFD_FLAG_RX_FIFO_ALMOST_FULL         CANFD_IFR_RAFIF            /*!< Rx FIFO almost full */
#define CANFD_FLAG_RX_FIFO_FULL                CANFD_IFR_RFIF             /*!< Rx FIFO full */
#define CANFD_FLAG_RX_FIFO_OVERFLOW            CANFD_IFR_ROIF             /*!< Overflow of CANFD Rx FIFO   */
#define CANFD_FLAG_ARB_LOST                    CANFD_IFR_ALIF             /*!< Arbitration lost detected   */
#define CANFD_FLAG_ERROR_PASSIVE               CANFD_IFR_EPIF             /*!< Error_Passive status changed  */
#define CANFD_FLAG_BUS_ERROR                   CANFD_IFR_BEIF             /*!< Bus_Off status changed       */
#define CANFD_FLAG_ERROR_TOGGLE                CANFD_IFR_EIF              /*!< Bus_Off status changed or Error_Passive status changed    */
#define CANFD_FLAG_TRIGGER_COMPLETE            CANFD_IFR_TTIF             /*!< Trigger Interrupt flag   */
#define CANFD_FLAG_TRIGGER_ERROR               CANFD_IFR_TEIF             /*!< Trigger error Interrupt flag   */
#define CANFD_FLAG_TIMESTAMP_WRAPAROUND        CANFD_IFR_WTIF             /*!< Timestamp counter wrapped around */

#define CANFD_FLAG_ALL_ERROR                   (CANFD_FLAG_RX_FIFO_OVERFLOW | CANFD_FLAG_ARB_LOST  |  \
                                                CANFD_FLAG_ERROR_PASSIVE    | CANFD_FLAG_BUS_ERROR |  \
                                                CANFD_FLAG_ERROR_TOGGLE     | CANFD_FLAG_TRIGGER_ERROR)
/**
  * @}
  */

/** @defgroup CANFD_interrupts CANFD Interrupts
  * @{
  */
#define CANFD_IT_TX_STB_COMPLETE           CANFD_IER_TSIE             /*!< STB Transmission Completed */
#define CANFD_IT_TX_PTB_COMPLETE           CANFD_IER_TPIE             /*!< PTB Transmission Completed */
#define CANFD_IT_ERROR_TOGGLE              CANFD_IER_EIE              /*!< Bus_Off status changed or Error_Passive status changed    */
#define CANFD_IT_RX_FIFO_ALMOST_FULL       CANFD_IER_RAFIE            /*!< Rx FIFO almost full */
#define CANFD_IT_RX_FIFO_FULL              CANFD_IER_RFIE             /*!< Rx FIFO full */
#define CANFD_IT_RX_FIFO_OVERFLOW          CANFD_IER_ROIE             /*!< Overflow of CANFD Rx FIFO   */
#define CANFD_IT_RX_COMPLETE               CANFD_IER_RIE              /*!< Rx Completed   */
#define CANFD_IT_ARB_LOST                  CANFD_IER_ALIE             /*!< Arbitration lost detected   */
#define CANFD_IT_ERROR_PASSIVE             CANFD_IER_EPIE             /*!< Error_Passive status changed  */
#define CANFD_IT_BUS_ERROR                 CANFD_IER_BEIE             /*!< Bus_Off status changed       */
#define CANFD_IT_TRIGGER_COMPLETE          CANFD_IER_TTIE             /*!< Trigger Interrupt flag   */
#define CANFD_IT_TIMESTAMP_WRAPAROUND      CANFD_IER_WTIE             /*!< Timestamp counter wrapped around */

